app/Controllers/AuthController.php

SELECT *
FROM `user`
WHERE `nama` = 'fajar'
 LIMIT 1
---
    public function login()
    {
        if ($this->request->getPost()) {
            $nama = $this->request->getVar('nama');
            $password = $this->request->getVar('password');

            $dataUser = $this->user->where(['nama' => $nama])->first();