app/Controllers/AuthController.php

INSERT INTO `user` (`nama`, `email`, `telp`, `user_role`, `password`) VALUES ('andi', 'andi@gmail.com', '09888778899', 'Customer', '91ec1f9324753048c0096d036a694f86')
---
    public function register()
    {
        if ($this->request->getPost()) {

            $this->user->insert([
                'nama' => $this->request->getVar('nama'), 'email' => $this->request->getVar('email'), 'telp' => $this->request->getVar('telp'),
                'user_role' => 'Customer', 'password' => md5($this->request->getVar('password'))
            ]);